src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиСинхронизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодНачалоПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьСправочники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соединение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МС_НастройкиПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НастройкаЗагрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МС_ЗапросыКВнешнимИсточникам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_ЗапросыКВнешнимИсточникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_ЗапросыКВнешнимИсточникам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресатПерсонализированнойРассылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКодЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияНовыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОбработанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопироватьФайлыВЛокальныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодифицироватьИмяФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураПодготовкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗапросаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧЗначенияПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧНастройкаСоответствий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьФайлыИзКаталогаИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/CommonModules/МС_ОбщегоНазначенияСервер/Ext/Module.bsl
Функция ВыполнитьСинхронизацию(НастройкаСинхронизации, ВернутьРезультат = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.НастройкаЗагрузки КАК НастройкаЗагрузки,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.Соединение КАК Соединение,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.НачалоПериода КАК НачалоПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериод КАК ВычисляемыйПериод,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериодНачалоПериода КАК ВычисляемыйПериодНачалоПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериодОкончаниеПериода КАК ВычисляемыйПериодОкончаниеПериода,
	|	МС_ЗапросыКВнешнимИсточникам.*
	|ИЗ
	|	Справочник.МС_НастройкиСинхронизации.НастройкиЗагрузки КАК МС_НастройкиСинхронизацииНастройкиЗагрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МС_ЗапросыКВнешнимИсточникам КАК МС_ЗапросыКВнешнимИсточникам
	|		ПО МС_НастройкиСинхронизацииНастройкиЗагрузки.НастройкаЗагрузки = МС_ЗапросыКВнешнимИсточникам.Ссылка
	|ГДЕ
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка = &Ссылка
	|	И МС_НастройкиСинхронизацииНастройкиЗагрузки.Активно = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаСинхронизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПараметров = Новый Структура;
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтруктураПараметров.Вставить(Колонка.Имя, ВыборкаДетальныеЗаписи[Колонка.Имя]);
		КонецЦикла;
		
		// Вычисление периода
		Если СтруктураПараметров.ВычисляемыйПериод Тогда
			Выполнить("СтруктураПараметров.НачалоПериода = " + СтруктураПараметров.ВычисляемыйПериодНачалоПериода);
			Выполнить("СтруктураПараметров.ОкончаниеПериода = " + СтруктураПараметров.ВычисляемыйПериодОкончаниеПериода);
		Иначе
			СтруктураПараметров.ОкончаниеПериода = КонецДня(СтруктураПараметров.ОкончаниеПериода);
		КонецЕсли; 
		
		СтруктураПараметров.ЗначенияПараметров = ВыборкаДетальныеЗаписи.ЗначенияПараметров.Выгрузить();
		СтруктураПараметров.НастройкаСоответствий = ВыборкаДетальныеЗаписи.НастройкаСоответствий.Выгрузить();
		
		РезультатЗапросаКИсточнику = ВыполнитьЗапросКИсточнику(СтруктураПараметров);
		
		Если ВернутьРезультат = Истина Тогда
			Возврат РезультатЗапросаКИсточнику;
		КонецЕсли; 
		
		Если Не РезультатЗапросаКИсточнику = Неопределено
			И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Процедура) Тогда
			СтрокаПараметров = "(НастройкиСинхронизации, СтруктураПараметров, РезультатЗапросаКИсточнику, РезультатЗагрузки)";
			Выполнить(ВыборкаДетальныеЗаписи.Процедура + СтрокаПараметров);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецФункции

Функция ВыполнитьЗапросКИсточнику(СтруктураПараметров) Экспорт
	
	ТекстЗапроса = СтруктураПараметров.ТекстЗапроса;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Соединение) Тогда
		СтруктураСоединения = Справочники.МС_НастройкиПодключений.ПолучитьСоединение(СтруктураПараметров.Соединение);
	Иначе	
		СтруктураСоединения = Неопределено;
	КонецЕсли; 
	
	Если СтруктураСоединения.Соединение = Неопределено Тогда
		Возврат СтруктураСоединения.СтрокаОшибок;
	КонецЕсли; 
	
	РезультатЗапроса = Неопределено;
	
	Если СтруктураПараметров.СпособЗапросаДанных = ""
		Или СтруктураПараметров.СпособЗапросаДанных = "ПроизвольныйРезультат" Тогда
		// произвольный запрос возвращает произвольный результат, который определен в коде запроса
		
		Выполнить(СтруктураПараметров.КодЗапроса);
		
	ИначеЕсли СтруктураПараметров.СпособЗапросаДанных = "ФайлыИзКаталога" Тогда
		// возвращает массив файлов 
		ВызватьИсключение("Необходим код обработки чтения файлов из каталога");
	ИначеЕсли СтруктураПараметров.СпособЗапросаДанных = "ФайлыСФТП" Тогда
		// возвращает массив файлов 
		
		МаскаФайлов = "*.xml";
		
		Если СтруктураПараметров.УдалятьФайлыИзКаталогаИсточника = Истина Тогда
			// Если удаляем в источнике, то всегда сохраняем себе
			СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина;
		КонецЕсли; 
		
		ФайлКаталогСохраненияНовыхФайлов 		= Новый Файл(СтруктураПараметров.КаталогСохраненияНовыхФайлов);
		ФайлКаталогСохраненияОбработанныхФайлов = Новый Файл(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов);
		ФайлКаталогСохраненияОшибок 			= Новый Файл(СтруктураПараметров.КаталогСохраненияОшибок);
		
		Если СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина Тогда
			// Проверяем сущесвование каталогов
			Если Не ФайлКаталогСохраненияНовыхФайлов.Существует() Тогда
				ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияНовыхФайлов) + " не существует");
			КонецЕсли; 
			Если Не ФайлКаталогСохраненияОбработанныхФайлов.Существует() Тогда
				ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов) + " не существует");
			КонецЕсли; 
			Если Не ФайлКаталогСохраненияОшибок.Существует() Тогда
				ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияОшибок) + " не существует");
			КонецЕсли; 
			
			// Убедимся, что это каталоги
			Если Не ФайлКаталогСохраненияНовыхФайлов.ЭтоКаталог() Тогда
				ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияНовыхФайлов) + " не является каталогом");
			КонецЕсли; 
			Если Не ФайлКаталогСохраненияОбработанныхФайлов.ЭтоКаталог() Тогда
				ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов) + " не является каталогом");
			КонецЕсли; 
			Если Не ФайлКаталогСохраненияОшибок.ЭтоКаталог() Тогда
				ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияОшибок) + " не является каталогом");
			КонецЕсли; 
		КонецЕсли; 
		
		СтруктураСоединения.Соединение.УстановитьТекущийКаталог(СтруктураПараметров.КаталогФайлов);
		МассивФайловВИсточнике = СтруктураСоединения.Соединение.НайтиФайлы("*", , Ложь);
		
		Если СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина Тогда
			
			Для каждого ФайлВИсточнике Из МассивФайловВИсточнике Цикл
				ПолноеИмяПолученногоФайла = СтруктураПараметров.КаталогСохраненияНовыхФайлов + "\" + ФайлВИсточнике.Имя;
				СтруктураСоединения.Соединение.Получить(ФайлВИсточнике.ПолноеИмя, ПолноеИмяПолученногоФайла);
				
				// Если копируем файл в локальный каталог, то последующая работа выполняется со скопированным файлом.
				НовыйПолученныйФайл = Новый Файл(ПолноеИмяПолученногоФайла);
				Если НовыйПолученныйФайл.Существует()
					И НовыйПолученныйФайл.ЭтоФайл() Тогда
					
					Если СтруктураПараметров.УдалятьФайлыИзКаталогаИсточника = Истина Тогда
						СтруктураСоединения.Соединение.Удалить(ФайлВИсточнике.ПолноеИмя);
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЦикла;
			
			РезультатЗапроса = НайтиФайлы(СтруктураПараметров.КаталогСохраненияНовыхФайлов, МаскаФайлов, Ложь);
			
		Иначе
			
			РезультатЗапроса = МассивФайловВИсточнике;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Возвращает структуру параметров из таблицы параметров
Функция СоответствиеПараметровСинхронизации(ТаблицаПараметров) Экспорт
	
	ЗначенияПараметров = Новый Соответствие;
	
	Для Каждого Стр Из ТаблицаПараметров Цикл
		ЗначенияПараметров.Вставить(Стр.ИмяПараметра, Стр.ЗначениеПараметра);
	КонецЦикла;
	
	Возврат ЗначенияПараметров;

КонецФункции

Функция ТипизироватьТаблицуЗначений(ТаблицаБезТипов) Экспорт
	
	ТаблицаИзМассива = Новый ТаблицаЗначений;
	
	Для каждого СтрокаТаблицы Из ТаблицаБезТипов Цикл
		
		НоваяСтрока = ТаблицаИзМассива.Добавить();
		
		Для каждого КолонкаТаблицы Из ТаблицаБезТипов.Колонки Цикл
			
			// Создаем таблицу, поэтому создаем и колонки
			Если ТаблицаИзМассива.Колонки.Найти(КолонкаТаблицы.Имя) = Неопределено Тогда
				// Новой колонке добавляем тип
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(СтрокаТаблицы[КолонкаТаблицы.Имя]));
				ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);
				ТаблицаИзМассива.Колонки.Добавить(КолонкаТаблицы.Имя, ДопустимыеТипы);
			Иначе
				// Если колонка уже есть, то нужно проверить ее тип с типом значения
				МассивТипов = ТаблицаИзМассива.Колонки.Найти(КолонкаТаблицы.Имя).ТипЗначения.Типы();
				Если МассивТипов.Найти(ТипЗнч(СтрокаТаблицы[КолонкаТаблицы.Имя])) = Неопределено Тогда
					МассивТипов.Добавить(ТипЗнч(СтрокаТаблицы[КолонкаТаблицы.Имя]));
					ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);
					ВременноеИмяКолонки = ТаблицаИзМассива.Колонки[КолонкаТаблицы.Имя].Имя + "Переименование";
					ТаблицаИзМассива.Колонки[КолонкаТаблицы.Имя].Имя = ВременноеИмяКолонки;
					ТаблицаИзМассива.Колонки.Добавить(КолонкаТаблицы.Имя, ДопустимыеТипы);
					ТаблицаИзМассива.ЗагрузитьКолонку(ТаблицаИзМассива.ВыгрузитьКолонку(ВременноеИмяКолонки), ТаблицаИзМассива.Колонки[КолонкаТаблицы.Имя]);
					ТаблицаИзМассива.Колонки.Удалить(ТаблицаИзМассива.Колонки[ВременноеИмяКолонки]);
				КонецЕсли;
			КонецЕсли; 
			
			НоваяСтрока[КолонкаТаблицы.Имя] = СтрокаТаблицы[КолонкаТаблицы.Имя];
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Если ТаблицаИзМассива.Количество() = 0 Тогда
		// Ничего не добавили, возвращаем таблицу без изменений (пустая таблица)
		Возврат ТаблицаБезТипов;
	Иначе
		// Таблица с типами.
		Возврат ТаблицаИзМассива;
	КонецЕсли; 
	
КонецФункции

Функция ОбъектМодифицирован(Объект, ПроверятьТабличныеЧасти = Истина, ПроверятьСтандартные = Истина, НепроверяемыеРеквизиты = "") Экспорт
	
	// На тот случай, если непроверяемый реквизит содержит имя другого реквизита (Например: ДатаПлатежа-Дата)
	МассивНепроверяемыеРеквизиты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НепроверяемыеРеквизиты, ",", Истина, Истина);
	
	Ссылка = Объект.Ссылка;
	Метаданное = Ссылка.Метаданные();
	
	Для каждого Реквизит из Метаданное.Реквизиты Цикл

		Если Не МассивНепроверяемыеРеквизиты.Найти(Реквизит.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли; 

		Если Объект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПроверятьСтандартные Тогда
		Для каждого Реквизит из Метаданное.СтандартныеРеквизиты Цикл
			Если Не МассивНепроверяемыеРеквизиты.Найти(Реквизит.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			Если Объект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	Если ПроверятьТабличныеЧасти Тогда
		Для каждого ТЧ из Метаданное.ТабличныеЧасти Цикл
			
			Если Объект[ТЧ.Имя].Количество() <> Ссылка[ТЧ.Имя].Количество() Тогда
				Возврат Истина;
			КонецЕсли;
			
			Для Индекс = 0 по Объект[ТЧ.Имя].Количество()-1 Цикл
				ОбъектСтрокаТЧ = Объект[ТЧ.Имя][Индекс];
				СсылкаСтрокаТЧ = Ссылка[ТЧ.Имя][Индекс];
				Для каждого РеквизитТЧ из ТЧ.Реквизиты Цикл
					Если Не МассивНепроверяемыеРеквизиты.Найти(РеквизитТЧ.Имя) = Неопределено Тогда
						Продолжить;
					КонецЕсли; 
					Если ОбъектСтрокаТЧ[РеквизитТЧ.Имя] <> СсылкаСтрокаТЧ[РеквизитТЧ.Имя] Тогда
						Возврат Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;        
	КонецЕсли;
	
	Возврат Ложь;
    
КонецФункции

#Область ПроцедурыИФункцииДляРаботыСОбъектомXMLЗапись

// Заменяет недопустимые символы XML на другой символ.
//
// Параметры:
//       Текст - Строка - текст, в котором следует заменить символы.
//       СимволЗамены - Строка - значение на которое следует заменять недопустимые символы.
// Возвращаемое значение:
//       Строка - результат замены.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	
	Позиция = НайтиНедопустимыеСимволыXML(Текст);
	Пока Позиция > 0 Цикл
		Текст = СтрЗаменить(Текст, Сред(Текст, Позиция, 1), СимволЗамены);
		Позиция = НайтиНедопустимыеСимволыXML(Текст);
	КонецЦикла;
	
	Возврат Текст;
КонецФункции

// Создает новый xml-узел
// Функция может быть использована в обработчиках событий, программный код. 
// которых хранится в правила обмена данными. Вызывается методом Выполнить().
//
// Параметры: 
//   Имя - Строка - имя узла.
//
// Возвращаемое значение:
//   ЗаписьXML - объект нового xml-узла.
//
Функция СоздатьУзел(Имя) Экспорт

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);

	Возврат ЗаписьXML;

КонецФункции

// Добавляет новый xml-узел к указанному узлу-родителю.
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить().
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации.
//
// Параметры: 
//  УзелРодитель   - xml-узел-родитель.
//  Имя            - Строка - имя добавляемого узла.
//
// Возвращаемое значение:
//  Новый xml-узел, добавленный к указанному узлу-родителю.
//
Функция ДобавитьУзел(УзелРодитель, Имя) Экспорт

	УзелРодитель.ЗаписатьНачалоЭлемента(Имя);

	Возврат УзелРодитель;

КонецФункции

// Копирует указанный xml-узел.
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить().
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации.
//
// Параметры: 
//  Узел           - xml - узел.
//
// Возвращаемое значение:
//  Новый xml - копия указанного узла.
//
Функция КопироватьУзел(Узел) Экспорт

	Стр = Узел.Закрыть();

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	//Если ВестиДополнительныйКонтрольЗаписиВXML Тогда
	//	
	//	Стр = УдалитьНедопустимыеСимволыXML(Стр);
	//	
	//КонецЕсли;
	
	ЗаписьXML.ЗаписатьБезОбработки(Стр);

	Возврат ЗаписьXML;
	
КонецФункции

// Осуществляет запись элемента и его значения в указанный объект.
//
// Параметры:
//  Объект         - ЗаписьXML - объект типа XMLЗапись.
//  Имя            - Строка - имя элемента.
//  Значение       - Произвольный - значение элемента.
//
Процедура одЗаписатьЭлемент(Объект, Имя, Значение="") Экспорт

	Объект.ЗаписатьНачалоЭлемента(Имя);
	Стр = XMLСтрока(Значение);
	
	//Если ВестиДополнительныйКонтрольЗаписиВXML Тогда
	//	
	//	Стр = УдалитьНедопустимыеСимволыXML(Стр);
	//	
	//КонецЕсли;
	
	Объект.ЗаписатьТекст(Стр);
	Объект.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// Устанавливает атрибут указанного xml-узла.
//
// Параметры: 
//  Узел           - xml-узел
//  Имя            - Строка - имя атрибута.
//  Значение       - Произвольный - устанавливаемое значение.
//
Процедура УстановитьАтрибут(Узел, Имя, Значение) Экспорт

	СтрокаЗаписи = XMLСтрока(Значение);
	
	//Если ВестиДополнительныйКонтрольЗаписиВXML Тогда
	//	
	//	СтрокаЗаписи = УдалитьНедопустимыеСимволыXML(СтрокаЗаписи);
	//	
	//КонецЕсли;
	
	Узел.ЗаписатьАтрибут(Имя, СтрокаЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСОбъектомXMLЧтение

// Пропускает узлы xml до конца указанного элемента (по умолчанию текущего).
//
// Параметры:
//  Объект   - ЧтениеXML - объект типа XMLЧтение.
//  Имя      - Строка - имя узла, до конца которого пропускаем элементы.
//
Процедура одПропустить(Объект, Имя = "") Экспорт

	КоличествоВложений = 0; // Количество одноименных вложений.

	Если Имя = "" Тогда
		
		Имя = Объект.ЛокальноеИмя;
		
	КонецЕсли; 
	
	Пока Объект.Прочитать() Цикл
		
		Если Объект.ЛокальноеИмя <> Имя Тогда
			Продолжить;
		КонецЕсли;
		
		ТипУзла = Объект.ТипУзла;
			
		Если ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				
			Если КоличествоВложений = 0 Тогда
					
				Прервать;
					
			Иначе
					
				КоличествоВложений = КоличествоВложений - 1;
					
			КонецЕсли;
				
		ИначеЕсли ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
			КоличествоВложений = КоличествоВложений + 1;
				
		КонецЕсли;
					
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
